[
  {
    "id": 1,
    "title": "Attack on Titan",
    "image": "https://media.revistagq.com/photos/6061de8b7e6648d674c91a59/master/pass/attack%20on%20titan.jpeg",
    "genres": ["Action", "Drama", "Mystery", "Fantasy"],
    "description": "In a world where humanity is on the brink of extinction, giant humanoid creatures known as Titans have brought civilization to its knees. The last remnants of humanity live in walled cities, isolated from the Titans' terror. Eren Yeager, a young boy whose life is changed forever when a Titan destroys his hometown, joins the military to fight back. Alongside his friends, Mikasa and Armin, he embarks on a journey to uncover the truth behind the Titans and humanity's mysterious downfall.",
    "score": 9.5,
    "platforms": ["Crunchyroll", "Hulu", "Funimation"],
    "year_started": 2013,
    "year_ended": "2024",
    "seasons": 4,
    "episodes_per_season": [25, 12, 22, 28]
  },
  {
    "id": 2,
    "title": "Naruto",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTi_KR7ll0cyUBynJEywZJGucRvyKmRvYPPHw&s",
    "genres": ["Action", "Adventure", "Fantasy", "Shounen"],
    "description": "Naruto Uzumaki, a young ninja with dreams of becoming the strongest in his village, has faced hardship and loneliness due to the demon fox sealed inside him. Despite this, he works tirelessly to gain the respect of his peers and prove that he is worthy of becoming the Hokage, the leader of his village. Along the way, Naruto forms bonds with his teammates Sasuke and Sakura, as well as his sensei, Kakashi, while also battling formidable enemies and discovering the true meaning of friendship and sacrifice.",
    "score": 8.8,
    "platforms": ["Netflix", "Hulu", "Crunchyroll"],
    "year_started": 2002,
    "year_ended": 2007,
    "seasons": 5,
    "episodes_per_season": [57, 43, 41, 42, 36]
  },
  {
    "id": 3,
    "title": "Death Note",
    "image": "https://es.web.img3.acsta.net/pictures/14/05/28/20/47/033239.jpg",
    "genres": ["Thriller", "Supernatural", "Psychological", "Mystery"],
    "description": "Light Yagami, a brilliant high school student, comes across a strange notebook known as the Death Note. This supernatural book gives its user the power to kill anyone whose name is written inside, as long as the user knows the person's face. Believing he can create a utopia free from crime, Light begins using the Death Note to eliminate wrongdoers, setting off a deadly cat-and-mouse game with L, a genius detective intent on stopping him. As their battle of intellects escalates, Light's sense of morality and justice becomes increasingly blurred.",
    "score": 9.0,
    "platforms": ["Crunchyroll", "Netflix"],
    "year_started": 2006,
    "year_ended": 2007,
    "seasons": 1,
    "episodes_per_season": [37]
  },
  {
    "id": 4,
    "title": "One Piece",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRDNrL8ouzgAUFxwE6YEKW_BFSdG-jPSzukRQ&s",
    "genres": ["Action", "Adventure", "Fantasy", "Shounen"],
    "description": "Monkey D. Luffy, a young and carefree pirate, sets out on a grand adventure to find the legendary treasure known as the 'One Piece' and become the Pirate King. Throughout his journey, Luffy assembles a diverse crew of talented individuals, each with their own dreams and aspirations. Together, they face powerful enemies, uncover ancient mysteries, and navigate a vast world filled with danger and intrigue. As Luffy and his crew venture across the Grand Line, their friendships are tested, and they confront the complexities of power, freedom, and legacy.",
    "score": 8.9,
    "platforms": ["Funimation", "Crunchyroll", "Netflix"],
    "year_started": 1999,
    "year_ended": "En emisión",
    "seasons": 24,
    "episodes_per_season": [
      61, 50, 49, 51, 51, 60, 70, 77, 98, 105, 103, 103, 100, 94, 95, 101, 118,
      117, 115, 110
    ]
  },
  {
    "id": 5,
    "title": "My Hero Academia",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRQe0iNm_J-4W9pdbhw0osSpEM_bB4GYmBnfw&s",
    "genres": ["Action", "Superhero", "Fantasy", "Shounen"],
    "description": "In a world where nearly everyone possesses superpowers known as 'Quirks,' Izuku Midoriya is one of the few people born without one. Despite this, he dreams of becoming a hero like his idol, All Might. After an encounter with All Might, Midoriya is granted a Quirk and enrolls in U.A. High School to train to become a professional hero. Midoriya and his classmates face numerous challenges, including fierce villains, powerful rivals, and the dark realities of the world they inhabit. The series explores themes of bravery, sacrifice, and what it means to be a hero.",
    "score": 8.7,
    "platforms": ["Hulu", "Funimation", "Crunchyroll"],
    "year_started": 2016,
    "year_ended": "En emisión",
    "seasons": 6,
    "episodes_per_season": [13, 25, 25, 25, 25, 25]
  },
  {
    "id": 6,
    "title": "Demon Slayer",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwIz67Al7_C4-t5UGowHQODjb2JckREy4sUA&s",
    "genres": ["Action", "Supernatural", "Adventure", "Fantasy"],
    "description": "Tanjiro Kamado is a kind-hearted boy who is determined to care for his family. However, his peaceful life is shattered when demons attack his home, leaving his family dead and his sister Nezuko transformed into a demon. Determined to turn her back into a human, Tanjiro becomes a Demon Slayer, joining an elite group of warriors tasked with ridding the world of demons. As Tanjiro faces various enemies, he discovers the depths of the demon world and uncovers secrets about his own past.",
    "score": 9.1,
    "platforms": ["Crunchyroll", "Netflix"],
    "year_started": 2019,
    "year_ended": "En emisión",
    "seasons": 3,
    "episodes_per_season": [26, 7, 11]
  },
  {
    "id": 7,
    "title": "Sword Art Online",
    "image": "https://www.mundodeportivo.com/alfabeta/hero/2023/03/sword-art-online-anime.jpg?width=768&aspect_ratio=16:9&format=nowebp",
    "genres": ["Action", "Adventure", "Fantasy", "Isekai"],
    "description": "In the near future, a virtual reality MMORPG named Sword Art Online is released, offering players a fully immersive gaming experience. However, when thousands of players log in for the first time, they discover that they are trapped in the game. The game's creator informs them that they can only escape by clearing all of the game's 100 floors. Kirito, a skilled player, must navigate through this deadly world and fight to survive, all while forming bonds with other players and discovering dark secrets about the game's true purpose.",
    "score": 7.5,
    "platforms": ["Netflix", "Hulu"],
    "year_started": 2012,
    "year_ended": "En emisión",
    "seasons": 5,
    "episodes_per_season": [25, 24, 24, 24, 24]
  },
  {
    "id": 8,
    "title": "Fullmetal Alchemist: Brotherhood",
    "image": "https://ramenparados.com/wp-content/uploads/2018/04/fullmetal.jpg",
    "genres": ["Action", "Adventure", "Fantasy", "Drama"],
    "description": "In a world where alchemy is a practiced science, two brothers, Edward and Alphonse Elric, attempt a forbidden alchemical ritual to bring their mother back to life. The ritual goes horribly wrong, and Edward loses an arm and a leg, while Alphonse's soul is bound to a suit of armor. The brothers embark on a journey to find the Philosopher's Stone, a powerful artifact that can restore their bodies. Along the way, they uncover a dark conspiracy and the true nature of alchemy itself.",
    "score": 9.4,
    "platforms": ["Crunchyroll", "Netflix", "Hulu"],
    "year_started": 2009,
    "year_ended": 2010,
    "seasons": 1,
    "episodes_per_season": [64]
  },
  {
    "id": 9,
    "title": "Tokyo Ghoul",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQiSnaMYGfGwSWUjcPzf4C10OGmHzIUHQBY7A&s",
    "genres": ["Action", "Horror", "Supernatural", "Psychological"],
    "description": "Ken Kaneki, a college student, narrowly survives an encounter with a ghoul, a creature that feeds on humans. He is saved by a surgeon who transplants ghoul organs into him, making him part human and part ghoul. As Kaneki struggles to adapt to his new identity, he is drawn into the dangerous world of ghouls, forced to confront his humanity and the darkness within. As he grapples with his newfound powers, he faces threats from both ghouls and humans, all while questioning the nature of his existence.",
    "score": 8.2,
    "platforms": ["Crunchyroll", "Hulu", "Funimation"],
    "year_started": 2014,
    "year_ended": "2018",
    "seasons": 4,
    "episodes_per_season": [12, 12, 12, 12]
  },
  {
    "id": 10,
    "title": "Steins; Gate",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJ8sPsmiM-8CWyL31SBI_6A3RgSC59_IKlJQ&s",
    "genres": ["Sci-Fi", "Thriller", "Psychological", "Mystery"],
    "description": "Rintarou Okabe, a self-proclaimed mad scientist, accidentally discovers time travel with his group of friends. Using a microwave and a mobile phone, they manage to send messages back in time, unintentionally altering the past and creating new realities. As they struggle with the consequences of their actions, they must contend with mysterious organizations and dark forces. The story explores the implications of time travel, fate, and sacrifice, leading to a complex and emotional journey filled with twists and mind-bending paradoxes.",
    "score": 9.0,
    "platforms": ["Funimation", "Crunchyroll"],
    "year_started": 2011,
    "year_ended": 2011,
    "seasons": 1,
    "episodes_per_season": [24]
  },
  {
    "id": 11,
    "title": "Dragon Ball Z",
    "image": "https://www.mundoplus.tv/wp-content/uploads/2024/10/dragonballzanimebox.jpg",
    "genres": ["Action", "Adventure", "Shounen", "Fantasy"],
    "description": "Goku and his friends defend Earth against an array of powerful enemies, including intergalactic villains and ancient creatures. The series is known for its epic battles, intense training sequences, and iconic transformations, like Super Saiyan. As Goku grows stronger and faces increasingly dangerous opponents, the stakes rise, and Earth is put in jeopardy time and time again. Dragon Ball Z follows Goku's evolution, not only as a fighter but as a mentor and father, alongside his companions who each have their own unique growth.",
    "score": 8.9,
    "platforms": ["Funimation", "Crunchyroll", "Hulu"],
    "year_started": 1989,
    "year_ended": 1996,
    "seasons": 9,
    "episodes_per_season": [39, 35, 41, 42, 39, 38, 35, 35, 34]
  },
  {
    "id": 12,
    "title": "Bleach",
    "image": "https://upload.wikimedia.org/wikipedia/tr/0/02/Bleach.jpg",
    "genres": ["Action", "Supernatural", "Shounen", "Fantasy"],
    "description": "Ichigo Kurosaki, a teenager with the ability to see ghosts, is thrust into the world of Soul Reapers, spiritual beings tasked with protecting humans from evil spirits. When Ichigo accidentally inherits the powers of a Soul Reaper, he becomes involved in battles between souls, evil spirits known as Hollows, and otherworldly forces. Bleach delves into themes of duty, sacrifice, and friendship, while Ichigo and his friends confront enemies that test both their physical and moral limits. The series is known for its diverse characters and intense, action-packed arcs.",
    "score": 8.2,
    "platforms": ["Netflix", "Crunchyroll", "Hulu"],
    "year_started": 2004,
    "year_ended": 2012,
    "seasons": 16,
    "episodes_per_season": [
      20, 21, 20, 22, 20, 22, 21, 18, 15, 21, 22, 24, 25, 22, 25, 24
    ]
  },
  {
    "id": 13,
    "title": "Cowboy Bebop",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiiISep5Hrqk6JsZ_EVCE_an2aB9fjKfQBPA&s",
    "genres": ["Action", "Sci-Fi", "Drama", "Space Western"],
    "description": "In a futuristic world where humanity has colonized the solar system, a group of bounty hunters known as the Bebop crew traverse space in search of criminals and bounties. The series follows Spike Spiegel, a laid-back yet skilled ex-gangster, and his diverse crew as they face their pasts, internal struggles, and dangerous criminals. Cowboy Bebop blends science fiction, jazz music, and existential themes, creating a timeless story about the search for meaning and redemption in a chaotic universe.",
    "score": 9.1,
    "platforms": ["Netflix", "Funimation", "Hulu"],
    "year_started": 1998,
    "year_ended": 1999,
    "seasons": 1,
    "episodes_per_season": [26]
  },
  {
    "id": 14,
    "title": "Hunter x Hunter",
    "image": "https://i.blogs.es/276013/hunter-x-hunter/1366_2000.jpeg",
    "genres": ["Action", "Adventure", "Fantasy", "Shounen"],
    "description": "Gon Freecss, a young boy with the dream of finding his father, sets out to become a Hunter—a licensed individual capable of accessing dangerous and uncharted territories. Along the way, Gon befriends Killua, Leorio, and Kurapika, each with their own motivations for becoming Hunters. Together, they face a series of trials, dangerous opponents, and emotional challenges. Hunter x Hunter is known for its unique power system, complex characters, and exploration of the nature of ambition and friendship.",
    "score": 9.0,
    "platforms": ["Crunchyroll", "Netflix"],
    "year_started": 2011,
    "year_ended": "En emisión",
    "seasons": 6,
    "episodes_per_season": [13, 12, 12, 12, 12, 12]
  },
  {
    "id": 15,
    "title": "Neon Genesis Evangelion",
    "image": "https://cinescopia.com/wp-content/uploads/2016/03/Neon-Genesis-Evangelion-12.jpg",
    "genres": ["Mecha", "Psychological", "Drama", "Sci-Fi"],
    "description": "In a post-apocalyptic world, a group of teenagers are recruited to pilot giant bio-mechanical robots known as Evangelions in the battle against monstrous beings called Angels. Shinji Ikari, an emotionally distant boy, is forced to pilot an Eva and fight for humanity’s survival. As the series progresses, it delves into complex psychological themes such as depression, the meaning of existence, and the burden of responsibility. Evangelion blends action with deep emotional exploration and philosophical reflection, making it one of the most influential anime of all time.",
    "score": 8.6,
    "platforms": ["Netflix"],
    "year_started": 1995,
    "year_ended": 1996,
    "seasons": 1,
    "episodes_per_season": [26]
  },
  {
    "id": 16,
    "title": "The Promised Neverland",
    "image": "https://m.media-amazon.com/images/S/pv-target-images/efaffe5e3810c457ee2b882e67b9c7b49be39154a30b0808363ad94fe2df94a3.jpg",
    "genres": ["Horror", "Thriller", "Mystery", "Drama"],
    "description": "In a seemingly idyllic orphanage, a group of children discover a horrific secret about their caretakers and their fate. Emma, Norman, and Ray, three of the brightest children, unravel the truth behind the 'Perfect Farm' and plan an escape to survive. As they face life-threatening challenges and confront the demons that haunt them, they must rely on their intelligence and bonds of friendship to outwit the sinister forces that control their world. The Promised Neverland is a suspenseful, emotional journey into survival, trust, and betrayal.",
    "score": 8.5,
    "platforms": ["Crunchyroll", "Hulu"],
    "year_started": 2019,
    "year_ended": 2021,
    "seasons": 2,
    "episodes_per_season": [12, 11]
  },
  {
    "id": 17,
    "title": "Vinland Saga",
    "image": "https://lh5.googleusercontent.com/proxy/VRMTZ3rWIsy4-1_imuVhlnUlnp-kknwbThAlwk-8jRARCrAUeDpztA6XL76Wc4uzSsK5LcT1lusD7Y_O6A5OsqMHCfjv-41oZyGDQBo",
    "genres": ["Action", "Historical", "Adventure", "Drama"],
    "description": "Thorfinn, a young Viking, seeks revenge against the man who killed his father, Askeladd, a cunning and ruthless leader. Set in a world where Norse mythology and historical events collide, Vinland Saga explores themes of vengeance, honor, and the brutal reality of war. As Thorfinn's journey unfolds, he learns that the path of revenge often leads to destruction and self-doubt. The series blends history with powerful character arcs, examining the costs of war and the pursuit of peace.",
    "score": 8.9,
    "platforms": ["Amazon Prime"],
    "year_started": 2019,
    "year_ended": "En emisión",
    "seasons": 2,
    "episodes_per_season": [24, 24]
  },
  {
    "id": 18,
    "title": "Black Clover",
    "image": "https://m.media-amazon.com/images/I/91dyTOTuCjL._AC_UF1000,1000_QL80_.jpg",
    "genres": ["Action", "Adventure", "Fantasy", "Shounen"],
    "description": "Asta and Yuno, two orphans, aspire to become the Wizard King in a world where magic is everything. While Yuno is naturally gifted with powerful magic, Asta is born without any magical abilities. Despite this, Asta is determined to prove his worth and earns the title of Magic Knight. Together, they embark on a journey filled with battles, powerful foes, and uncovering the secrets of the Wizard Kingdom. Black Clover is a high-energy, action-packed series about perseverance, friendship, and the power of determination.",
    "score": 8.1,
    "platforms": ["Crunchyroll", "Funimation"],
    "year_started": 2017,
    "year_ended": "En emisión",
    "seasons": 4,
    "episodes_per_season": [51, 52, 51, 51]
  },
  {
    "id": 19,
    "title": "Mob Psycho 100",
    "image": "https://wallpapers.com/images/hd/mob-psycho-100-pictures-rzyfjm4pm4te6jce.jpg",
    "genres": ["Comedy", "Action", "Supernatural", "Psychological"],
    "description": "Shigeo 'Mob' Kageyama is a middle schooler with overwhelming psychic powers, but he strives for normalcy. As Mob tries to navigate his school life, he is confronted by his emotions and the need to control his powers. With the help of his mentor Reigen, a self-proclaimed 'great psychic,' Mob faces both everyday challenges and powerful foes. Mob Psycho 100 balances comedy, action, and psychological depth, exploring themes of self-worth, control, and growth.",
    "score": 8.6,
    "platforms": ["Crunchyroll", "Funimation"],
    "year_started": 2016,
    "year_ended": 2019,
    "seasons": 3,
    "episodes_per_season": [12, 13, 10]
  },
  {
    "id": 20,
    "title": "Fire Force",
    "image": "https://areajugones.sport.es/wp-content/uploads/2022/05/fire-force-1.jpg",
    "genres": ["Action", "Supernatural", "Fantasy", "Shounen"],
    "description": "In a world where spontaneous human combustion turns people into deadly infernals, Special Fire Force Company 8 is tasked with putting these beings to rest. Shinra Kusakabe, a young recruit with the ability to ignite his feet at will, is determined to become a hero. As he joins his fellow fire soldiers, they uncover a mysterious force behind the infernals and the cause of these tragic transformations. Fire Force is a high-octane series filled with action, mystery, and a touch of comedy.",
    "score": 7.9,
    "platforms": ["Crunchyroll", "Funimation"],
    "year_started": 2019,
    "year_ended": "En emisión",
    "seasons": 2,
    "episodes_per_season": [24, 24]
  },
  {
    "id": 21,
    "title": "Dr. Stone",
    "image": "https://wallpapers.com/images/featured/dr-stone-6gc11l8dfl4aps11.jpg",
    "genres": ["Sci-Fi", "Adventure", "Shounen", "Comedy"],
    "description": "After a mysterious event causes the sudden petrification of humanity, high schooler Senku Ishigami awakens thousands of years later in a world devoid of civilization. With his scientific knowledge, Senku strives to rebuild society from scratch. His goal is to bring back modern technology, starting with the simplest of inventions, and using science to restore humanity. Dr. Stone is an inventive, thought-provoking anime that combines science with adventure and explores human ingenuity in the face of extinction.",
    "score": 8.2,
    "platforms": ["Crunchyroll", "Funimation"],
    "year_started": 2019,
    "year_ended": "En emisión",
    "seasons": 3,
    "episodes_per_season": [24, 24, 11]
  },
  {
    "id": 22,
    "title": "One Punch Man",
    "image": "https://i.blogs.es/5216b6/one-punch-man/1366_2000.jpeg",
    "genres": ["Action", "Comedy", "Superhero", "Sci-Fi"],
    "description": "Saitama, a man with incredible strength, has become so powerful that he can defeat any opponent with a single punch. However, this leaves him bored and unsatisfied with his existence. Despite his overwhelming power, he seeks recognition and purpose by joining the Hero Association, where he struggles to find a worthy opponent. One Punch Man blends intense action with humor and satirical commentary on superhero tropes, offering a fresh take on the genre.",
    "score": 8.8,
    "platforms": ["Netflix", "Crunchyroll"],
    "year_started": 2015,
    "year_ended": "En emisión",
    "seasons": 2,
    "episodes_per_season": [12, 12]
  },
  {
    "id": 23,
    "title": "Your Name",
    "image": "https://hips.hearstapps.com/hmg-prod/images/your-name-poster-1547566631.jpeg?crop=0.8xw:1xh;center,top&resize=1200:*",
    "genres": ["Romance", "Drama", "Fantasy", "Supernatural"],
    "description": "Mitsuha, a girl living in rural Japan, and Taki, a boy from Tokyo, mysteriously swap bodies in their sleep. As they begin to navigate each other's lives, they form a connection and try to understand the cause of their strange situation. Your Name is a beautifully animated film that explores themes of love, destiny, and the passage of time, while blending romance with supernatural elements and a heartbreaking twist.",
    "score": 8.7,
    "platforms": ["Netflix", "Crunchyroll"],
    "year_started": 2016,
    "year_ended": "En emisión",
    "seasons": 1,
    "episodes_per_season": [1]
  },
  {
    "id": 24,
    "title": "Naruto: Shippuden",
    "image": "https://play-lh.googleusercontent.com/nwL8eFXaahMvQX6Nez6f2uIZG-Wm1ORRNvwALBUCCAKKt1CH6nLKxs59nmM6dyaSveQ",
    "genres": ["Action", "Adventure", "Fantasy", "Shounen"],
    "description": "Naruto Uzumaki, a young ninja with dreams of becoming the strongest and most respected ninja in his village, faces his greatest challenges as a teenager. In Naruto: Shippuden, Naruto returns after two and a half years of training and confronts new threats to his village, including the dangerous Akatsuki organization. Alongside his friends, Naruto embarks on a journey of self-discovery and battle, facing enemies both external and internal. The series explores themes of perseverance, friendship, and the cost of achieving one's dreams.",
    "score": 8.6,
    "platforms": ["Crunchyroll", "Hulu", "Netflix"],
    "year_started": 2007,
    "year_ended": 2017,
    "seasons": 21,
    "episodes_per_season": [
      32, 28, 26, 25, 29, 21, 22, 20, 17, 22, 17, 21, 23, 24, 22, 17, 24, 21,
      21, 17, 10
    ]
  }
]
